Revit 2024 API
IndependentTag.SetIsLeaderVisible Method
 Set tag's leader that points to specified reference to be visible or not. This option can be set only if the LeadersPresentationMode is ShowSpecificLeaders.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public void SetIsLeaderVisible(
	Reference referenceTagged,
	bool visible
)
Visual Basic
Public Sub SetIsLeaderVisible ( _
	referenceTagged As Reference, _
	visible As Boolean _
)
Visual C++
public:
void SetIsLeaderVisible(
	Reference^ referenceTagged,
	bool visible
)
Parameters
referenceTagged
Type: Autodesk.Revit.DB.Reference
 The reference which is tagged.
visible
Type: System.Boolean
 True for showing the leader, false to hide it.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  The specified reference is not currently tagged.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The IndependentTag object does not have a tag behavior. -or- The LeadersPresentationMode should be set to ShowSpecificLeaders.
See Also
IndependentTag Class
Autodesk.Revit.DB Namespace